In [ ]:
from pathlib import Path

import pandas as pd


DATA_DIR = Path("/mnt/data/Projects/Data/FTN/colon/IBD_AI")
PROJECT_DIR = Path("/mnt/projects/inflammatory_bowel_dissease/ulcerative_colitis")

In [ ]:
df1 = pd.read_excel(DATA_DIR / "IBD_AI_FTN.xlsx", index_col=0)
df1

          Nancy
ID
858/22        2
859/22        2
860/22        2
861/22        3
862/22        3
...         ...
16185/21      3
16055/21      3
16054/21      3
1590/21       0
52941/24      0

[1341 rows x 1 columns]

In [ ]:
df2 = pd.read_excel(DATA_DIR / "IBD_AI_FTN_doplnek.xlsx", index_col=0)
df2 = df2.dropna()
df2["Nancy"] = df2["Nancy"].astype(int)
df2

           Nancy
ID
31757/23       2
39951/21       1
38812/23       4
52017/24       3
20508/21       1
38879/23       3
39548/21       4
220467/24      3
42299/23       0
4850/24        0
19467/24       1
3549/21        4
12531/21       4
53955/24       1
654/21         2
1172/24        0
28565/23       1
45489/24       2
42297/23       1
42298/23       2

In [ ]:
df = pd.concat([df1, df2], axis=0)
df

          Nancy
ID
858/22        2
859/22        2
860/22        2
861/22        3
862/22        3
...         ...
1172/24       0
28565/23      1
45489/24      2
42297/23      1
42298/23      2

[1361 rows x 1 columns]

In [ ]:
df.to_csv(PROJECT_DIR / "IBD_AI.csv", index=True)